    <footer class="cabinet-footer">
        <div class="cabinet-footer__container">
            <div class="cabinet-footer__wrap">
                <p class="cabinet-footer__subtitle p2"><span>Баланс</span></p>
                <div class="cabinet-footer__balance">
                    <p class="cabinet-footer__balance__text p2">На твоем счете</p>
                    <p class="cabinet-footer__balance__price h3">500</p>
                    <svg class="cabinet-footer__balance__coin" width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <rect x="1.43555" y="1" width="28.8966" height="30" rx="14.4483" stroke="#DDA06B" stroke-width="2" />
                        <path d="M8.43596 16.1088C8.43596 17.2479 8.65037 18.3007 9.07899 19.268C9.50782 20.2354 10.0882 21.0713 10.8207 21.7766C11.5529 22.4815 12.4101 23.0283 13.3924 23.4171C14.3747 23.8057 15.4198 24 16.5271 24C17.3487 24 18.1478 23.9279 18.925 23.783C19.7019 23.6385 20.4028 23.4077 21.0279 23.0915C21.653 22.775 22.171 22.3639 22.582 21.8575C22.9927 21.3513 23.2427 20.7278 23.3321 19.9864C23.3321 19.5345 23.1846 19.1457 22.8899 18.8202C22.5951 18.495 22.1888 18.3322 21.671 18.3322C21.3136 18.3322 21.0411 18.4677 20.8537 18.7391C20.6662 19.0102 20.5723 19.3085 20.5723 19.6341C20.5723 19.9414 20.6572 20.217 20.8271 20.4611C20.9966 20.7053 21.2602 20.827 21.6174 20.827C21.4388 21.4055 21.0994 21.8302 20.5993 22.1016C20.0992 22.3726 19.5546 22.5083 18.9651 22.5083C18.1433 22.5083 17.4467 22.2913 16.8752 21.8575C16.3038 21.4237 15.8348 20.8723 15.4686 20.2035C15.1024 19.5345 14.8389 18.8159 14.6781 18.0476C14.5172 17.279 14.4371 16.5514 14.4371 15.8647C14.4371 15.4667 14.4639 15.0195 14.5172 14.5223C14.571 14.0251 14.6647 13.5281 14.7986 13.0311C14.9327 12.5339 15.1112 12.0594 15.3345 11.6074C15.5578 11.1555 15.8391 10.7667 16.1784 10.4415C16.7678 9.899 17.4197 9.62777 18.134 9.62777C18.4018 9.62777 18.6652 9.67301 18.9246 9.76328C19.1835 9.85355 19.438 10.0074 19.6879 10.2244C19.4735 10.1702 19.2772 10.1431 19.0984 10.1431C18.6877 10.1431 18.3126 10.238 17.9732 10.4279C17.6337 10.6176 17.3392 10.8707 17.089 11.1869C16.8391 11.5034 16.6426 11.8607 16.4995 12.2581C16.3567 12.6561 16.2851 13.0628 16.2851 13.4785C16.2851 13.8581 16.3565 14.2242 16.4995 14.5767C16.6424 14.9293 16.8391 15.232 17.089 15.4851C17.339 15.7382 17.6337 15.9414 17.9732 16.0951C18.3126 16.2489 18.6788 16.3254 19.0716 16.3254C19.5361 16.3254 19.9602 16.226 20.3443 16.0273C20.7282 15.8284 21.0543 15.5618 21.3223 15.227C21.59 14.8928 21.7999 14.513 21.9519 14.0881C22.1039 13.6634 22.1795 13.234 22.1795 12.7999C22.1795 12.0044 21.9832 11.3039 21.59 10.6983C21.1972 10.0927 20.7017 9.59108 20.1031 9.19331C19.5048 8.79575 18.8397 8.49743 18.1073 8.29834C17.375 8.09966 16.6785 8 16.0175 8C14.9994 8 14.0348 8.21702 13.124 8.65085C12.213 9.08489 11.4095 9.66341 10.7127 10.3864C10.016 11.1096 9.4623 11.941 9.05181 12.8812C8.6409 13.8212 8.43555 14.7975 8.43555 15.8101V16.1082L8.43596 16.1088Z" fill="#DDA06B" />
                    </svg>
                </div>
                <p class="cabinet-footer__text p2">Будь внимателен, Солярики сгорают в конце учебного года</p>
                <p class="cabinet-footer__subtitle p2"><span>Уровень</span></p>
                <div class="cabinet-footer__level">
                    <svg class="cabinet-footer__level__stars" width="73" height="24" viewBox="0 0 73 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M12.666 0L15.3602 8.2918H24.0787L17.0253 13.4164L19.7194 21.7082L12.666 16.5836L5.61259 21.7082L8.30676 13.4164L1.25334 8.2918H9.97185L12.666 0Z" fill="#DDA06B" />
                        <path d="M36.666 0L39.3602 8.2918H48.0787L41.0253 13.4164L43.7194 21.7082L36.666 16.5836L29.6126 21.7082L32.3068 13.4164L25.2533 8.2918H33.9718L36.666 0Z" fill="#DDA06B" />
                        <path d="M60.666 0L63.3602 8.2918H72.0787L65.0253 13.4164L67.7194 21.7082L60.666 16.5836L53.6126 21.7082L56.3068 13.4164L49.2533 8.2918H57.9718L60.666 0Z" fill="#DDA06B" />
                    </svg>
                    <p class="cabinet-footer__level__text h3">Эксперт</p>
                </div>
                <p class="cabinet-footer__text p1">2500 баллов</p>
                <p class="cabinet-footer__text p2">Сумма баллов по всем ролям</p>
            </div>
            <div class="cabinet-footer__wrap">
                <p class="cabinet-footer__subtitle p2"><span>Рейтинг</span></p>
                <div class="cabinet-footer__rating">
                    <p class="cabinet-footer__text p2">Рейтинг в классе</p>
                    <p class="cabinet-footer__text p1">1 место из 1</p>
                    <p class="cabinet-footer__text cabinet-footer__text_orange p2">Поздравляем!</p>
                </div>
                <div class="cabinet-footer__rating">
                    <p class="cabinet-footer__text p2">Рейтинг в параллели</p>
                    <p class="cabinet-footer__text p1">10 место из 36</p>
                    <p class="cabinet-footer__text p2">до следующего места не хватает 30 баллов</p>
                </div>
                <div class="cabinet-footer__rating">
                    <p class="cabinet-footer__text p2">Рейтинг в школе</p>
                    <p class="cabinet-footer__text p1">64 место из 583</p>
                    <p class="cabinet-footer__text p2">до следующего места не хватает 180 баллов</p>
                </div>
            </div>
            <div class="cabinet-footer__wrap">
                <p class="cabinet-footer__subtitle p2"><span>Портфолио</span></p>
                <p class="cabinet-footer__text p2">Все твои результаты сохраняются в течение учебного года, ты можешь посмотреть историю достижений в портфолио</p>
                <button class="cabinet-footer__button botton btn">Портфолио</button>
            </div>
        </div>
    </footer>